	.LINK 1000

        EMT     14

	MOV    #233,R0  ; режим 32 символа
	EMT    16	
	MOV    #232,R0  ; скрытие курсора
	EMT    16	

START:	MOV	#40000,R1
	MOV	#177,R2
ROW:	MOV	#20,R3
COL:	MOVB	#377,(R1)+
	MOVB	#252,(R1)+
	MOVB	#125,(R1)+
	MOVB	#000,(R1)+
	DEC	R3
	CMP	R3,#0
	BNE	COL
	DEC	R2
	CMP	R2,#0
	BNE	ROW

	MOV	#7,R1   ; позиция курсора
	MOV	#16,R2
	EMT	24

	MOV	#177777,@#212   ;красный фон;
	MOV	#52525,@#214   ;синий цвет;
	MOV	#101,R0
	EMT	16

	MOV	#52525,@#212   ;синий фон;
	MOV	#177777,@#214  ;красный цвет;
	MOV	#60,R0
	EMT	16

	MOV	#52525,@#212   ;синий фон;
        MOV	#125252,@#214   ;зеленый цвет
	MOV	#44,R0
	EMT	16

	MOV	#0,@#212    ;черный фон;
        MOV	#125252,@#214   ;зеленый цвет
	MOV	#102,R0
	EMT	16

	MOV	#125252,@#212    ;зеленый фон;
        MOV	#0,@#214   ;черный цвет
	MOV	#103,R0
	EMT	16


	MOV	#7,R1   ; позиция курсора
	MOV	#21,R2
	EMT	24

	MOV	#0,@#212    ;черный фон;
        MOV	#125252,@#214   ;зеленый цвет
		
	MOV	#TXT,R1     ; Вывод строки длиной 5 символов   
	MOV	#5,R2
	EMT	20               

	MOV	#7,R1   ; позиция курсора
	MOV	#24,R2
	EMT	24

	MOV	#0,@#212    ;черный фон;
        MOV	#177777,@#214   ;красный цвет
		
	MOV	#TXT2,R1     ; Вывод строки по умолчанию с нулем на конце
	MOV	#0,R2               
	EMT	20               

	JMP	START

TXT:    .BYTE   101,60,44,102,103,104,0 
TXT2:   .BYTE   101,60,44,102,103,104,105,101,60,44,102,103,104,0 
        .EVEN
        .END

make_bk0010_rom "test_print.bin", 1000
